---
kind: method
id: M:Autodesk.Revit.DB.Lighting.PresetInitialColor.#ctor(Autodesk.Revit.DB.Lighting.PresetInitialColor)
source: html/8aceed4c-054a-f9ed-b1b3-8c7521e5d5b0.htm
---
# Autodesk.Revit.DB.Lighting.PresetInitialColor.#ctor Method

Creates a copy of the given preset initial color

## Syntax (C#)
```csharp
public PresetInitialColor(
	PresetInitialColor other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.PresetInitialColor`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null